app/controllers/sheets_controller.rb

SELECT  "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", 423717]]
---
  def details
    @sheet = Sheet.find(params[:id])

SELECT  "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", 423717]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = ?  [["sheet_id", 423717]]
---
  def transactions
    @transactions = [];
    unless params[:weekly]
      @rows = Sheet.find(params[:id]).rows.group_by { |x| x.date.beginning_of_month }

SELECT  "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", 981605]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = ? AND "rows"."credit" IS NULL AND (strftime('%m %Y', created_at) = 'Jan 2015')  [["sheet_id", 606458]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = $1 AND "rows"."credit" IS NULL AND ("rows"."date" BETWEEN '2015-03-01 00:00:00.000000' AND '2015-03-31 23:59:59.999999')  [["sheet_id", 688787]]
SELECT SUM("rows"."debit") FROM "rows" WHERE "rows"."sheet_id" = ? AND "rows"."credit" IS NULL AND (remarks like '%Airtime Purchase%')  [["sheet_id", 981605]]
SELECT SUM("rows"."debit") FROM "rows" WHERE "rows"."sheet_id" = $1 AND "rows"."credit" IS NULL AND ("rows"."date" BETWEEN '2015-03-01 00:00:00.000000' AND '2015-03-31 23:59:59.999999') AND "rows"."tag" = $2  [["sheet_id", 688787], ["tag", 1]]
---
  def expenses
    @response = {}
    @transactions = Sheet.find(params[:id]).rows.where({credit: nil})
    @months = @transactions.group_by { |x| x.date.beginning_of_month }
    @weeks = @transactions.group_by { |x| x.date.beginning_of_week }
    @expense_total = @transactions.inject(0) {|sum,e| sum += e.debit }

    @pattern = []
    @months.each do |period, rows|
      m = period.month; y = period.year
      spending = {
        period: period.strftime("%b %Y"),
        total: (rows.inject(0) {|sum,e| sum += e.debit }),
        average: (rows.inject(0) {|sum,e| sum += e.debit }) / (Time::days_in_month(m,y).to_f / 7)
      }
      @pattern.push(spending)
    end

    @transactions = @transactions.where(date: DateTime.strptime(params[:month], '%b %Y').beginning_of_month..DateTime.strptime(params[:month], '%b %Y').end_of_month) if params[:month]

    @response['stats'] = {
      total: @expense_total,
      subtotal: @transactions.inject(0) {|sum,e| sum += e.debit },
      average_month:  @expense_total / @months.length,
      pattern: @pattern
    }

    @airtime = @transactions.where({tag: 1})

SELECT  "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", 981605]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = ? AND "rows"."debit" IS NULL  [["sheet_id", 981605]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = $1 AND "rows"."debit" IS NULL AND ("rows"."date" BETWEEN '2015-01-01 00:00:00.000000' AND '2015-01-31 23:59:59.000000')  [["sheet_id", 595514]]
SELECT SUM("rows"."credit") FROM "rows" WHERE "rows"."sheet_id" = $1 AND "rows"."debit" IS NULL AND ("rows"."date" BETWEEN '2015-01-01 00:00:00.000000' AND '2015-01-31 23:59:59.000000') AND "rows"."tag" = $2  [["sheet_id", 595514], ["tag", 2]]
---
  def income
    @response = {}
    @transactions = Sheet.find(params[:id]).rows.where({debit: nil})
    @months = @transactions.group_by { |x| x.date.beginning_of_month }
    @weeks = @transactions.group_by { |x| x.date.beginning_of_week }
    @income_total = @transactions.inject(0) {|sum,e| sum += e.credit }

    @pattern = []
    @months.each do |period, rows|
      m = period.month; y = period.year
      income = {
        period: period.strftime("%b %Y"),
        total: (rows.inject(0) {|sum,e| sum += e.credit }),
        average: (rows.inject(0) {|sum,e| sum += e.credit }) / (Time::days_in_month(m,y).to_f / 7)
      }
      @pattern.push(income)
    end

    @transactions = @transactions.where(date: DateTime.strptime(params[:month], '%b %Y').beginning_of_month..DateTime.strptime(params[:month], '%b %Y').end_of_month) if params[:month]

    @response['stats'] = {
      total: @income_total,
      subtotal: @transactions.inject(0) {|sum,e| sum += e.credit },
      average_month:  @income_total / @months.length,
      pattern: @pattern
    }

    @transfers = @transactions.where({tag: 2})

SELECT  "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", 981605]]
SELECT "rows".* FROM "rows" WHERE "rows"."sheet_id" = ? AND (remarks like '%something%')  [["sheet_id", 981605]]
---
  def search
    @query = params[:query]
    @transactions = Sheet.find(params[:id]).rows.where("remarks ilike ?", "%#{@query}%")